gcc -g p1final.c
îº§ gdb ./a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x79f: file p1final.c, line 9.
(gdb) r
Starting program: /home/runner/pps-test1-Mayur2728-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:9
9   {
(gdb) n
11    printf("Enter two numbers\n");
(gdb) n
Enter two numbers
12    scanf("%f %f",&number1 , &number2);
(gdb) n
n
13    result=addition(number1,number2);
(gdb) n
14    printf("%f + %f is %f",number1,number2,result);
(gdb) n
15    return 0;
(gdb) n
16    }(gdb) s
__libc_start_main (main=0x559db8800797 <main>, argc=1, argv=0x7ffc07e036e8, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffc07e036d8) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
0.000000 + 0.000000 is 0.000000[Inferior 1 (process 81) exited normally]
(gdb) l
339 in ../csu/libc-start.c
(gdb) q