 gcc -g p2final.c
 gdb ./a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x722: file p2final.c, line 5.
(gdb) r
Starting program: /home/runner/pps-test1-Mayur2728-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:5
5   {
(gdb) n
unable to run, main file "main.sh" not found
 gcc -g p3final.c
 gdb ./a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x7b1: file p3final.c, line 17.
(gdb) r
Starting program: /home/runner/pps-test1-Mayur2728-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

unable to run, main file "main.sh" not found
 gcc -g p2final.c
 gdb ./a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x722: file p2final.c, line 5.
(gdb) r
Starting program: /home/runner/pps-test1-Mayur2728-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:5
5   {
(gdb) n
7     printf("enter two numbers:");
(gdb) n
8     scanf("%d%d",&a,&b);
(gdb) n
enter two numbers:23
65
9     int show =add(a,b);
(gdb) n
10    printf("sum of two numbers is:%d",show);
(gdb) n
11    return 0;
(gdb) n
12  }
(gdb) s
__libc_start_main (main=0x5590a3c0071a <main>, argc=1, argv=0x7ffd8944ba28, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffd8944ba18) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
sum of two numbers is:88[Inferior 1 (process 226) exited normally]
(gdb) l
339 in ../csu/libc-start.c
(gdb) q